bhargavyelli/ALL-_Codes/workspace_1.19.0/STM32_UART_RTOS_Counting_Semaphore/Core/Src/main.c
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "stm32l476xx.h"
#include <stdio.h>


#define configUSE_PREEMPTION        1
#define configUSE_TIME_SLICING      1




/* Function Prototypes */
void UART2_Init(void);
void UART_SendString(char *str);

void TaskA(void *pvParameters);
void TaskB(void *pvParameters);
void TaskC(void *pvParameters);

/* Counting Semaphore */
SemaphoreHandle_t xCountingSem;

int main(void)
{
    UART2_Init();

    /* Create counting semaphore
       Max count = 2
       Initial count = 2
    */
    xCountingSem = xSemaphoreCreateCounting(2, 2);

    if(xCountingSem == NULL)
    {
        while(1);  // Failed
    }

    /* Create Tasks */
    xTaskCreate(TaskA, "TaskA", 512, NULL, 1, NULL);
    xTaskCreate(TaskB, "TaskB", 512, NULL, 1, NULL);
    xTaskCreate(TaskC, "TaskC", 512, NULL, 1, NULL);

    vTaskStartScheduler();

    while(1);
}

void TaskA(void *pvParameters)
{
    while(1)
    {
        xSemaphoreTake(xCountingSem, portMAX_DELAY);

        UART_SendString("Task A entered\r\n");

        vTaskDelay(pdMS_TO_TICKS(3000));

        UART_SendString("Task A exiting\r\n");

        xSemaphoreGive(xCountingSem);

        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

void TaskB(void *pvParameters)
{
    while(1)
    {
        xSemaphoreTake(xCountingSem, portMAX_DELAY);

        UART_SendString("Task B entered\r\n");

        vTaskDelay(pdMS_TO_TICKS(3000));

        UART_SendString("Task B exiting\r\n");

        xSemaphoreGive(xCountingSem);

        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

void TaskC(void *pvParameters)
{
    while(1)
    {
        xSemaphoreTake(xCountingSem, portMAX_DELAY);

        UART_SendString("Task C entered\r\n");

        vTaskDelay(pdMS_TO_TICKS(3000));

        UART_SendString("Task C exiting\r\n");

        xSemaphoreGive(xCountingSem);

        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

void UART2_Init(void)
{
    RCC->AHB2ENR |= RCC_AHB2ENR_GPIOAEN;
    RCC->APB1ENR1 |= RCC_APB1ENR1_USART2EN;

    /* PA2 -> TX */
    GPIOA->MODER &= ~(3 << (2*2));
    GPIOA->MODER |=  (2 << (2*2));   // Alternate function

    GPIOA->AFR[0] |= (7 << (4*2));   // AF7

    USART2->BRR = 4000000 / 115200;
    USART2->CR1 |= USART_CR1_TE;
    USART2->CR1 |= USART_CR1_UE;
}

void UART_SendString(char *str)
{
    while(*str)
    {
        while(!(USART2->ISR & USART_ISR_TXE));
        USART2->TDR = *str++;
    }
}


